app/Controllers/Page.php

SELECT sum(tunggakandu+tunggakanspp+tunggakantl) as nilai
FROM `santri`
SELECT sum(tunggakandu+tunggakanspp+tunggakantl) as nilai
FROM `alumni`
WHERE `kelas` = 'lulus'
---
    public function keuangan()
    {
        $santrimodel = new SantriModel();
        $psbmodel = new PsbModel();
        $alumnimodel = new AlumniModel();
        $data = [
            'datapsb' => $psbmodel->select('sum(tdu) as nilai')
                ->where('status', 'diterima')
                ->findAll(),
            'datasantri' => $santrimodel->select('sum(tunggakandu+tunggakanspp+tunggakantl) as nilai')
                ->findAll(),
            'dataalumni' => $alumnimodel->select('sum(tunggakandu+tunggakanspp+tunggakantl) as nilai')
                ->where('kelas', 'lulus')->findAll()

SELECT *
FROM `transfer`
WHERE `kelas` != 'lulus'
AND `program` != 'psb'
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function mutasi()
    {

        $transferModel = new TransferModel();
        $transferPSB = new TransferModel();
        $transferAlumni = new TransferModel();
        $keyword = $this->request->getPost('keyword');
        if ($keyword) {
            $transfer = $transferModel->search($keyword);
            $transferpsbmodel = $transferPSB->search($keyword);
            $transferalumnimodel = $transferAlumni->search($keyword);
        } else {
            $transfer = $transferModel;
            $transferpsbmodel = $transferPSB;
            $transferalumnimodel = $transferAlumni;
        }
        $data = [
            'transferpsb' => $transferpsbmodel->orderBy('tanggal', 'desc')->where('program', 'psb')->findAll(5),
            'transfer' => $transfer->orderBy('tanggal', 'desc')->where('kelas !=', 'lulus')->where('program !=', 'psb')->findAll(5),

SELECT *
FROM `alumni`
WHERE `kelas` = 'lulus'
 LIMIT 5
---
    public function datatunggakan()
    {

        $santri = new SantriModel();
        $alumni = new AlumniModel();
        $psb = new PsbModel();
        $keyword = $this->request->getPost('keyword');
        if ($keyword) {
            $datasantri = $santri->search($keyword);
            $dataalumni = $alumni->search($keyword);
            $datapsb = $psb->search($keyword);
        } else {
            $datasantri = $santri;
            $dataalumni = $alumni;
            $datapsb = $psb;
        }
        $data = [
            'transferpsb' => $datapsb->where('status', 'diterima')->findAll(5),
            'transfer' => $datasantri->findAll(5),
            'transferalumni' => $dataalumni->where('kelas', 'lulus')->findAll(5)